# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
a=['a','b','c']
b=[10,20,30]
arr=np.array(b)
dic={'a':30,'b':20,'c':30}

In [5]:
#creating series
pd.Series(data=b,index=a)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(dic)

a    30
b    20
c    30
dtype: int64

In [8]:
ser2=pd.Series([1,2,3,4],['USA','Japan','China','India'])

In [11]:
#accessing series by its index
ser2['China']

3

# Dataframes

In [12]:
#creating dataframes
df=pd.DataFrame(data=np.random.randint(0,100,20).reshape(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [13]:
df

    W   X   Y   Z
A  76  10  62  70
B  33  21  41  64
C  36  88   0  71
D  40  79  64  96
E  55   4  62  62

In [14]:
#indexing and slicing in dataframes
df['W']

A    76
B    33
C    36
D    40
E    55
Name: W, dtype: int32

In [15]:
type(df['W'])

pandas.core.series.Series

In [16]:
#slicing 2 columns 
df[['W','Z']]

    W   Z
A  76  70
B  33  64
C  36  71
D  40  96
E  55  62

In [17]:
#creating new column
df['new']=df['W']+df['X']

In [18]:
df

    W   X   Y   Z  new
A  76  10  62  70   86
B  33  21  41  64   54
C  36  88   0  71  124
D  40  79  64  96  119
E  55   4  62  62   59

In [20]:
#deleting a column
df.drop('new',axis=1,inplace=True)

In [21]:
df

    W   X   Y   Z
A  76  10  62  70
B  33  21  41  64
C  36  88   0  71
D  40  79  64  96
E  55   4  62  62

In [24]:
#droping a row
df.drop('E',axis=0)

    W   X   Y   Z
A  76  10  62  70
B  33  21  41  64
C  36  88   0  71
D  40  79  64  96

In [26]:
# indexing by rows
df.loc['A']

W    76
X    10
Y    62
Z    70
Name: A, dtype: int32

In [27]:
type(df.loc['A'])

pandas.core.series.Series

In [28]:
df.loc['B','Y']

41

In [30]:
#accessing the subset of dataframe
df.loc[['A','B'],['W','Z']]

    W   Z
A  76  70
B  33  64